sterentev/atdf-device-asm-include/inc/ATtiny40.inc
; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  INTERRUPT_SENSE_CONTROL	:::: values
;			0b00		; Low Level of INTX
;			0b01		; Any logical change on INTX
;			0b10		; Falling Edge of INTX
;			0b11		; Rising Edge of INTX



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 18
.equ	INT_VECTORS_SIZE	= 0x24
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Reset, Power-on Reset and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	PCINT0		; Pin Change Interrupt Request 0
;	3	PCINT1		; Pin Change Interrupt Request 1
;	4	PCINT2		; Pin Change Interrupt Request 2
;	5	WDT		; Watchdog Time-out
;	6	TIM1_CAPT	; Timer/Counter1 Input Capture
;	7	TIM1_COMPA	;  Timer/Counter1 Compare Match A
;	8	TIM1_COMPB	;  Timer/Counter1 Compare Match B
;	9	TIM1_OVF	; Timer/Counter1 Overflow
;	10	TIM0_COMPA	; Timer/Counter0 Compare Match A
;	11	TIM0_COMPB	; Timer/Counter0 Compare Match B
;	12	TIM0_OVF	; Timer/Counter0 Overflow
;	13	ANA_COMP	; Analog Comparator
;	14	ADC		; Conversion Complete
;	15	TWI_SLAVE	; Two-Wire Interface
;	16	SPI		; Serial Peripheral Interface
;	17	QTRIP		; Touch Sensing



; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "ATtiny40.inc"
;#	
;#	; FUSES BYTE0 byte (addr 0x00)
;#	.set	BODLEVEL	= 0x70	; Brown-out detection disabled; [BODLEVEL=111]
;#	.set	FUSES_BYTE0	= 0xFF \
;#				  &  (~BODLEVEL_MASK | BODLEVEL) \
;#				  & ~(0 <<CKOUT) \
;#				  & ~(0 <<WDTON) \
;#				  & ~(0 <<RSTDISBL)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB)
;#	.message "====================="
;#	.message "=====  Fuses  ======="
;#	.message "BYTE0		", FUSES_BYTE0
;#	.message "===== Lockbits ======"
;#	.message " LOCKBIT	", LOCKBITS_LOCKBIT
;#	.message "====================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET_ISR	; RESET		 - External Reset, Power-on Reset and Watchdog Reset
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; PCINT2	 - Pin Change Interrupt Request 2
;#		reti			; WDT		 - Watchdog Time-out
;#		reti			; TIM1_CAPT	 - Timer/Counter1 Input Capture
;#		reti			; TIM1_COMPA	 -  Timer/Counter1 Compare Match A
;#		reti			; TIM1_COMPB	 -  Timer/Counter1 Compare Match B
;#		reti			; TIM1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIM0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIM0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; TIM0_OVF	 - Timer/Counter0 Overflow
;#		reti			; ANA_COMP	 - Analog Comparator
;#		reti			; ADC		 - Conversion Complete
;#		reti			; TWI_SLAVE	 - Two-Wire Interface
;#		reti			; SPI		 - Serial Peripheral Interface
;#		reti			; QTRIP		 - Touch Sensing
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET_ISR:
;#		cli
;#		ldi	r16, high(ADDR_SRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_SRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY40_INC_ */

; ************************ END OF FILE *********************************

